app/controllers/building_locations_controller.rb

SELECT "building_locations".* FROM "building_locations" ORDER BY "building_locations"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def index
    @building_locations = BuildingLocation.all

SELECT "building_locations".* FROM "building_locations" WHERE "building_locations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @building_location = BuildingLocation.find(params[:id])

INSERT INTO "building_locations" ("location_name", "address", "latitude", "longitude", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
SELECT "building_locations".* FROM "building_locations" ORDER BY "building_locations"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def create
    @building_location = BuildingLocation.new(building_location_params)
    if @building_location.save
      render turbo_stream: turbo_stream.replace("location", partial: "building_locations/body_container", locals: { building_locations: BuildingLocation.all })

SELECT "building_locations".* FROM "building_locations" WHERE "building_locations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "building_locations" SET "location_name" = ?, "address" = ?, "latitude" = ?, "longitude" = ?, "updated_at" = ? WHERE "building_locations"."id" = ?
SELECT "building_locations".* FROM "building_locations" ORDER BY "building_locations"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def update
    @building_location = BuildingLocation.find(params[:id])
    if @building_location.update(building_location_params)
      render turbo_stream: turbo_stream.replace("location", partial: "building_locations/body_container", locals: { building_locations: BuildingLocation.all })